### Pandas기초
- 1 데이터 셀랙션 및 필터링

In [1]:
pip install pandas

Requirement already satisfied: pandas in /Users/seoinhyeog/opt/anaconda3/lib/python3.9/site-packages (1.3.4)
Requirement already satisfied: python-dateutil>=2.7.3 in /Users/seoinhyeog/opt/anaconda3/lib/python3.9/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2017.3 in /Users/seoinhyeog/opt/anaconda3/lib/python3.9/site-packages (from pandas) (2021.3)
Requirement already satisfied: numpy>=1.17.3 in /Users/seoinhyeog/opt/anaconda3/lib/python3.9/site-packages (from pandas) (1.20.3)
Requirement already satisfied: six>=1.5 in /Users/seoinhyeog/opt/anaconda3/lib/python3.9/site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

## Series
1개의 컬럼 값으로 구성된 1차원 데이터 셋

In [5]:
data= ["A","B","C","D"]
se= pd.Series(data)
se

0    A
1    B
2    C
3    D
dtype: object

In [6]:
se.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
se.values

array(['A', 'B', 'C', 'D'], dtype=object)

In [8]:
# 인덱싱
print(se[1])
print(se[3])

B
D

In [9]:
#슬라이싱
print(se[:3])
print(se[:])

0    A
1    B
2    C
dtype: object
0    A
1    B
2    C
3    D
dtype: object

In [10]:
#컬럼 이름 변경

se.name= "alphabet"
se

0    A
1    B
2    C
3    D
Name: alphabet, dtype: object

In [13]:
# 인덱스 이름 설정
se.index.name="No."
se

No.
0    A
1    B
2    C
3    D
Name: alphabet, dtype: object

In [15]:
#Series 생성시 index 지정하기
data= ["a","b","c","d"]
se= pd. Series(date,index=["a","b","c","d"])
print(se)
print(se['a'])# index 값으로 가져오기

a    A
b    B
c    C
d    D
dtype: object
A

In [5]:
#Series 생성 이후 index 지정하기
se.index=[1,2,3,4]
print(se)
se.index=[1,2,3,5]
print(se)

1    A
2    B
3    C
4    D
dtype: object
1    A
2    B
3    C
5    D
dtype: object

In [3]:
data = ["A", "B", "C", "D"]
se = pd.Series(data)
se

0    A
1    B
2    C
3    D
dtype: object

In [6]:
se > 40

TypeError: '>' not supported between instances of 'str' and 'int'

## DataFrame

In [3]:
import numpy as np

data= np.array([[1,2,3],[4,5,6],[7,8,9]])
column = ["D","E","F"]
df=pd.DataFrame(data)
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [5]:
#DataFrame

data={
    'country':["kor","usa","china","japan"],
    'rank': [1,2,3,4],
    'grade' : ["A","B","C","D"]
      }
#print(date)
df=pd.DataFrame(data)
df

  country  rank grade
0     kor     1     A
1     usa     2     B
2   china     3     C
3   japan     4     D

In [29]:
## 하나의 컬럼 조회
df.country

0      kor
1      usa
2    china
3    japan
Name: country, dtype: object

In [30]:
## 하나의 컬럼 조회
df["country"]

0      kor
1      usa
2    china
3    japan
Name: country, dtype: object

In [31]:
## 둘이상의 컬럼 조회

print(df[['country','rank']]) # 대괄호는 두번 감싸야됨

  country  rank
0     kor     1
1     usa     2
2   china     3
3   japan     4

In [33]:
# 1개행 가져오기
df.loc[0]

country    kor
rank         1
grade        A
Name: 0, dtype: object

In [32]:
## 2개 이상의 행 조회
df.loc[0:2]

  country  rank grade
0     kor     1     A
1     usa     2     B
2   china     3     C

In [34]:
df.loc[[0,2]]# 인덱스값 0,2 행 가져오기

  country  rank grade
0     kor     1     A
2   china     3     C

In [35]:
df.loc[0,'grade']# 행과 열의 좌표

'A'

In [36]:
df.loc[0:2,['country','grade']]

  country grade
0     kor     A
1     usa     B
2   china     C

In [43]:
df.loc[(df['grade']=="A") | (df['rank']>2)]

  country  rank grade
0     kor     1     A
2   china     3     C
3   japan     4     D

In [ ]:
# 데이터 셀력션이 중요한이유 내가 직접 데이터를 정해야 되기 때문에!!
loc는 로케이션 베이스 
loc와 iloc 차이 이해하기

In [6]:
df.iloc[0:3,0:2] #행,열 #iloc는 무조건 정수기반

  country  rank
0     kor     1
1     usa     2
2   china     3

In [ ]:
# 한국과 일본을 가져오기 랭크와 그래드를 가져올 수 있는 컬럼을 만들어보기

In [8]:
df.loc[(df['country']=="kor") | (df['country']=="japan")]

  country  rank grade
0     kor     1     A
3   japan     4     D

In [20]:
df.iloc[[0,3],[1,2]] #1단계 iloc로 데이터를 몇개 불러온다.
        #행     #열

   rank grade
0     1     A
3     4     D

## filter()를 이용한 검색

In [25]:
df.filter?

In [22]:
df.filter(items=['country','rank'])

  country  rank
0     kor     1
1     usa     2
2   china     3
3   japan     4

In [27]:
df.filter(like="c",axis=1)#인덱스가 c가 들어가는 값 검색

  country
0     kor
1     usa
2   china
3   japan

In [ ]:
#그렇다면 axis는 뭘까?

In [30]:
# 데이터 추가 하기
#1번 스리즈를 추가하여 열 데이터 추가
president=pd.Series(["yoon","biden","kishida","jinping"], index=[0,1,2,3])
president

0       yoon
1      biden
2    kishida
3    jinping
dtype: object

In [32]:
#2번df안에 president를 넣어줘!
df['president']= president
df

  country  rank grade president
0     kor     1     A      yoon
1     usa     2     B     biden
2   china     3     C   kishida
3   japan     4     D   jinping

In [34]:
# Numpy를 이용하여 열 데이터 추가
import numpy as np

#gdp=pd.Series([0,0,0,0],index=[0,1,2,3])
add= np.zero(4).astype(int)
df["etc"]=add
df

AttributeError: module 'numpy' has no attribute 'zero'

## 밑에 주어진 데이터를 가지고 문제 풀기

In [35]:


data={
    "영화" :["명량","극한직업","신과함께-죄와벌","국제시장","괴물"],
    "개봉 연도":[2014,2019,2017,2014,2006],
    "관객 수" :[1761,1626,1441,1426,1301],
    "평점" : [8.88,9.20,8.73,9.16,8.62] }
df=pd.DataFrame(data)
df

In [46]:
#문제01영화 정보만 출력하세요!
df["영화"]

0          명량
1        극한직업
2    신과함께-죄와벌
3        국제시장
4          괴물
Name: 영화, dtype: object

In [47]:
#문제 02 전제 데이터 주에서 영화와평점 정보를 출력하세요!
df.filter(items=['영화','평점'])

         영화    평점
0        명량  8.88
1      극한직업  9.20
2  신과함께-죄와벌  8.73
3      국제시장  9.16
4        괴물  8.62

In [62]:
#  2015년 이후에 개봉한 영화 데이터중에서 영화 ,개봉연도 정보를 출력하세요!
#1번 개봉연도 2015이후 그리고 영화가져오기
df.loc[(df['개봉 연도']>2015)][["영화","개봉 연도"]]

         영화  개봉 연도
1      극한직업   2019
2  신과함께-죄와벌   2017

# 주어진 계산식 을 참고하여 추천 첨수 컬럼을 추가하세요!
- 추천 점수 = (관객 점수* 평점)//100
## (1) 추천 점수 series를 만들자.(2) 추천 점수 seriese를 추가해주자.

In [64]:
df['추천 점수']=(df["관객 수"] * df["평점"])//100
df

         영화  개봉 연도  관객 수    평점  추천 점수
0        명량   2014  1761  8.88  156.0
1      극한직업   2019  1626  9.20  149.0
2  신과함께-죄와벌   2017  1441  8.73  125.0
3      국제시장   2014  1426  9.16  130.0
4        괴물   2006  1301  8.62  112.0

## 5) 전제 데이터를 '개봉 연도' 순으로 내림차순으로 출력하세요!

In [59]:
df.sort_values(by=["개봉 연도"],ascending=False)

         영화  개봉 연도  관객 수    평점
1      극한직업   2019  1626  9.20
2  신과함께-죄와벌   2017  1441  8.73
0        명량   2014  1761  8.88
3      국제시장   2014  1426  9.16
4        괴물   2006  1301  8.62